:PROPERTIES:
:header-args: :tangle no :mkdirp yes :results output silent :no-expand t
:END:
**** dropbox in org
#+begin_src sh  
grep --include=\*.cljs -rnw ./ -e "reagent"
#+end_src       

#+RESULTS:
| ./src/keechma_todomvc/components/new_todo.cljs:5:                          | [reagent.core                      | :as                     | reagent]))           |                        |                      |                     |           |             |            |        |                 |            |
| ./src/keechma_todomvc/components/new_todo.cljs:18:                         | function                           | will                    | be                   | called                 | each                 | time                | `reagent` | needs       | to         | render | the             |            |
| ./src/keechma_todomvc/components/new_todo.cljs:24:                         | (let                               | [new-title              | (reagent/atom        | "")]                   |                      |                     |           |             |            |        |                 |            |
| ./src/keechma_todomvc/subscriptions.cljs:4:                                | Subscription                       | functions               | return               | `reagent               | reactions`           | that                | cause     |             |            |        |                 |            |
| ./src/keechma_todomvc/subscriptions.cljs:8:                                | [reagent.ratom                     | :refer-macros           | [reaction]]))        |                        |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/debug.cljs:1:(ns                      | reagent.debug                      |                         |                      |                        |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/debug.cljs:2:                         | (:require-macros                   | [reagent.debug]))       |                      |                        |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/impl/util.cljs:1:(ns                  | reagent.impl.util                  |                         |                      |                        |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/impl/util.cljs:5:                     | [reagent.debug                     | :refer-macros           | [dev?]]))            |                        |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/impl/protocols.cljs:1:(ns             | reagent.impl.protocols)            |                         |                      |                        |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/impl/batching.cljs:1:(ns              | reagent.impl.batching              |                         |                      |                        |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/impl/batching.cljs:3:                 | (:require                          | [reagent.debug          | :refer-macros        | [assert-some]]         |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/impl/batching.cljs:4:                 | [reagent.impl.util                 | :refer                  | [is-client]]))       |                        |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/impl/component.cljs:1:(ns             | reagent.impl.component             |                         |                      |                        |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/impl/component.cljs:4:                | [reagent.impl.util                 | :as                     | util]                |                        |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/impl/component.cljs:5:                | [reagent.impl.batching             | :as                     | batch]               |                        |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/impl/component.cljs:6:                | [reagent.impl.protocols            | :as                     | p]                   |                        |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/impl/component.cljs:7:                | [reagent.ratom                     | :as                     | ratom]               |                        |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/impl/component.cljs:8:                | [reagent.debug                     | :refer-macros           | [dev?                | warn                   | warn-unless          | assert-callable]])) |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/impl/component.cljs:47:(defn          | ^boolean                           | reagent-class?          | [c]                  |                        |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/impl/component.cljs:55:(defn          | ^boolean                           | reagent-component?      | [^clj                | c]                     |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/impl/component.cljs:79:               | ;;                                 | using                   | :render              | instead                | of                   | :reagent-render     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/impl/component.cljs:94:               | (ifn?                              | res)                    | (let                 | [f                     | (if                  | (reagent-class?     | res)      |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/impl/component.cljs:237:              | (assert                            | (not                    | (:componentFunction  | fmap))                 | ":component-function | is                  | no        | longer      | supported, | use    | :reagent-render | instead.") |
| ./target/public/cljs-out/dev/reagent/impl/component.cljs:238:              | (assert                            | (pos?                   | (count               | renders))              | "Missing             | reagent-render")    |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/impl/component.cljs:246:              | (str                               | (gensym                 | "reagent")))         |                        |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/impl/component.cljs:353:              | (not                               | (reagent-class?         | f))))                |                        |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/impl/component.cljs:359:              | (if                                | (reagent-class?         | f)                   |                        |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/impl/component.cljs:362:              | withrender                         | (assoc                  | spec                 | :reagent-render        | f)                   |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/impl/component.cljs:384:              | (ifn?                              | res)                    | (let                 | [f                     | (if                  | (reagent-class?     | res)      |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/impl/component.cljs:425:              | reagent-state                      | (.-current              | state-ref)           |                        |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/impl/component.cljs:428:              | rat                                | ^ratom/Reaction         | (gobj/get            | reagent-state          | "cljsRatom")]        |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/impl/component.cljs:433:              | (some->                            | (gobj/get               | reagent-state        | "cljsRatom")           | ratom/dispose!)))    |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/impl/component.cljs:439:              | (set!                              | (.-argv                 | reagent-state)       | argv)                  |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/impl/component.cljs:441:              | (batch/mark-rendered               | reagent-state)          |                      |                        |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/impl/component.cljs:447:              | #(functional-do-render             | compiler                | reagent-state)       |                        |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/impl/component.cljs:448:              | reagent-state                      |                         |                      |                        |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/impl/input.cljs:1:(ns                 | reagent.impl.input                 |                         |                      |                        |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/impl/input.cljs:2:                    | (:require                          | [reagent.impl.component | :as                  | comp]                  |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/impl/input.cljs:3:                    | [reagent.impl.batching             | :as                     | batch]               |                        |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/impl/input.cljs:4:                    | [reagent.impl.protocols            | :as                     | p]))                 |                        |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/impl/input.cljs:146:                  | :reagent-render                    |                         |                      |                        |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/impl/template.cljs:1:(ns              | reagent.impl.template              |                         |                      |                        |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/impl/template.cljs:4:                 | [reagent.impl.util                 | :as                     | util                 | :refer                 | [named?]]            |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/impl/template.cljs:5:                 | [reagent.impl.component            | :as                     | comp]                |                        |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/impl/template.cljs:6:                 | [reagent.impl.input                | :as                     | input]               |                        |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/impl/template.cljs:7:                 | [reagent.impl.protocols            | :as                     | p]                   |                        |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/impl/template.cljs:8:                 | [reagent.ratom                     | :as                     | ratom]               |                        |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/impl/template.cljs:9:                 | [reagent.debug                     | :refer-macros           | [dev?                | warn]]                 |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/impl/template.cljs:306:               | (let                               | [id                     | (gensym              | "reagent-compiler")    |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/ratom.cljs:1:(ns                      | reagent.ratom                      |                         |                      |                        |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/ratom.cljs:3:                         | (:require-macros                   | [reagent.ratom])        |                      |                        |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/ratom.cljs:4:                         | (:require                          | [reagent.impl.util      | :as                  | util]                  |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/ratom.cljs:5:                         | [reagent.debug                     | :refer-macros           | [warn                | dev?]]                 |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/ratom.cljs:6:                         | [reagent.impl.batching             | :as                     | batch]               |                        |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/ratom.cljs:108:                       | (-write                            | writer                  | (str                 | #object[reagent.ratom. | s                    | "                   | "))       |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/dom.cljs:1:(ns                        | reagent.dom                        |                         |                      |                        |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/dom.cljs:3:                           | [reagent.impl.util                 | :as                     | util]                |                        |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/dom.cljs:4:                           | [reagent.impl.template             | :as                     | tmpl]                |                        |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/dom.cljs:5:                           | [reagent.impl.batching             | :as                     | batch]               |                        |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/dom.cljs:6:                           | [reagent.impl.protocols            | :as                     | p]                   |                        |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/dom.cljs:7:                           | [reagent.ratom                     | :as                     | ratom]))             |                        |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/core.cljs:1:(ns                       | reagent.core                       |                         |                      |                        |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/core.cljs:2:                          | (:require-macros                   | [reagent.core])         |                      |                        |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/core.cljs:5:                          | [reagent.impl.template             | :as                     | tmpl]                |                        |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/core.cljs:6:                          | [reagent.impl.component            | :as                     | comp]                |                        |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/core.cljs:7:                          | [reagent.impl.util                 | :as                     | util]                |                        |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/core.cljs:8:                          | [reagent.impl.batching             | :as                     | batch]               |                        |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/core.cljs:9:                          | [reagent.impl.protocols            | :as                     | p]                   |                        |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/core.cljs:10:                         | [reagent.ratom                     | :as                     | ratom]               |                        |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/core.cljs:11:                         | [reagent.debug                     | :as                     | deb                  | :refer-macros          | [assert-some         | assert-component    |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/core.cljs:85:                         | :reagent-render                    | (fn                     | [args....])          |                        |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/core.cljs:94:                         | Everything                         | is                      | optional,            | except                 | either               | :reagent-render     | or        | :render.    |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/core.cljs:372:                        | :superseded-by                     | "reagent.dom/render"}   |                      |                        |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/reagent/core.cljs:374:                        | (throw                             | (js/Error.              | "Reagent.core/render | function               | was                  | moved               | to        | reagent.dom | namespace  | in     | Reagent         | v1.0.")))  |
| ./target/public/cljs-out/dev/keechma_todomvc/components/new_todo.cljs:5:   | [reagent.core                      | :as                     | reagent]))           |                        |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/keechma_todomvc/components/new_todo.cljs:18:  | function                           | will                    | be                   | called                 | each                 | time                | `reagent` | needs       | to         | render | the             |            |
| ./target/public/cljs-out/dev/keechma_todomvc/components/new_todo.cljs:24:  | (let                               | [new-title              | (reagent/atom        | "")]                   |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/keechma_todomvc/components/todo_edit.cljs:5:  | [reagent.core                      | :as                     | reagent]))           |                        |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/keechma_todomvc/components/todo_edit.cljs:12: | Returns                            | a                       | `reagent             | class`                 | created              | from                | a         | map         | that       | allows | us              | to         |
| ./target/public/cljs-out/dev/keechma_todomvc/components/todo_edit.cljs:13: | provide                            | additional              | component            | data                   | to                   | `reagent`           | including |             |            |        |                 |            |
| ./target/public/cljs-out/dev/keechma_todomvc/components/todo_edit.cljs:29: | todo-title                         | (reagent/atom           | (:title              | edit-todo))            |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/keechma_todomvc/components/todo_edit.cljs:41: | focus-input                        | #(let                   | [node                | (reagent/dom-node      | %)                   |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/keechma_todomvc/components/todo_edit.cljs:45: | (reagent/create-class              |                         |                      |                        |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/keechma_todomvc/components/todo_edit.cljs:47: | :reagent-render                    | render                  |                      |                        |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/keechma_todomvc/subscriptions.cljs:4:         | Subscription                       | functions               | return               | `reagent               | reactions`           | that                | cause     |             |            |        |                 |            |
| ./target/public/cljs-out/dev/keechma_todomvc/subscriptions.cljs:8:         | [reagent.ratom                     | :refer-macros           | [reaction]]))        |                        |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/keechma/app_state/react_native_router.cljs:3: | [reagent.core                      | :as                     | r]                   |                        |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/keechma/app_state.cljs:2:                     | (:require                          | [reagent.core           | :as                  | reagent                | :refer               | [cursor]]           |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/keechma/app_state.cljs:14:                    | [reagent.ratom                     | :refer                  | [reaction]]))        |                        |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/keechma/app_state.cljs:95:                    | (reagent/atom                      | (merge                  | {:route              | {}                     |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/keechma/app_state.cljs:200:                   | (reagent/render-component          | (app-renderer           | state)               | container)             |                      |                     |           |             |            |        |                 |            |
| ./target/public/cljs-out/dev/keechma/app_state.cljs:202:                   | (reagent/unmount-component-at-node | container)))))          |                      |                        |                      |                     |           |             |            |        |                 |            |


**** dropbox in org
#+begin_src sh  
grep --include=\*.cljs -rnw ./ -e "reagent.core"
#+end_src       

#+RESULTS:
| ./src/keechma_todomvc/components/new_todo.cljs:5:                          | [reagent.core    | :as             | reagent])) |         |        |           |
| ./target/public/cljs-out/dev/reagent/core.cljs:1:(ns                       | reagent.core     |                 |            |         |        |           |
| ./target/public/cljs-out/dev/reagent/core.cljs:2:                          | (:require-macros | [reagent.core]) |            |         |        |           |
| ./target/public/cljs-out/dev/keechma_todomvc/components/new_todo.cljs:5:   | [reagent.core    | :as             | reagent])) |         |        |           |
| ./target/public/cljs-out/dev/keechma_todomvc/components/todo_edit.cljs:5:  | [reagent.core    | :as             | reagent])) |         |        |           |
| ./target/public/cljs-out/dev/keechma/app_state/react_native_router.cljs:3: | [reagent.core    | :as             | r]         |         |        |           |
| ./target/public/cljs-out/dev/keechma/app_state.cljs:2:                     | (:require        | [reagent.core   | :as        | reagent | :refer | [cursor]] |


